Repository: miurahr/aqtinstall-docs-omegat-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: This is the minimum decompressed size, in bytes, of the modules that aqt is permitted to list. The authors of aqt have discovered that the Qt repository contains a few mysteriously "empty" modules, including the examples modules for `qtlottie` and `qtquicktimeline`. These modules consist of a single archive that contains empty directories, and they are exactly 40 bytes when uncompressed. The authors feel that it is not useful for ``aqt list-*`` to list these empty modules. If you want to print these modules with ``aqt list-*``, please feel free to change the `min_module_size` value to something less than 40.
ja: これは、aqtがリスト可能なモジュールの解凍後の最小サイズ(バイト単位)です。aqtの作者は、Qtリポジトリにいくつかの不可解な"空の"モジュールが含まれていることを発見しました。その中には``qtlottie`` や``qtquicktimeline``のモジュール例も含まれています。これらのモジュールは空のディレクトリを含む単一のアーカイブから構成されており、解凍すると正確に40バイトになります。著者は、``aqt list-*`` がこれらの空のモジュールをリストすることは有用ではないと感じています。これらのモジュールを ``aqt list-*`` で印刷したい場合は、``min_module_size`` の値を40未満に変更してください。

source: This is the relative or absolute path to the location in which ``.7z`` archives will be downloaded, when ``--keep`` is turned on.
ja: これは、``--keep`` がオンになっている場合に、``.7z`` アーカイブがダウンロードされる場所への相対パスまたは絶対パスです。

source: This metadata is displayed in a table that includes long display names for each module.
ja: このメタデータは、各モジュールの長い表示名を含む表に表示されます。

source: This metadata is displayed in a table, and includes versions and release dates for each tool.
ja: このメタデータは表形式で表示され、各ツールのバージョンとリリース日が含まれます。

source: This option also works for all of the other subcommands that begin with ``aqt install-``.
ja: このオプションは、``aqt install-`` で始まる他のすべてのサブコマンドにも使えます。

source: This option is applicable to all the ``install-*`` commands except for ``install-tool``.
ja: このオプションは、``install-tool``を除くすべての ``install-*`` コマンドに適用できます。

source: This option only applicable to ``install-qt``, ``install-example``, and ``install-doc``.
ja: このオプションは、 ``install-qt``、 ``install-example`` 、 ``install-doc`` にのみ適用できます。

source: This parameter exists for backwards compatibility reasons, and its value is ignored.
ja: このパラメータは下位互換性のために存在し、その値は無視されます。

source: This section of the documentation is meant to walk you through the process of finding out what packages are available to ``aqt``, so you can tell ``aqt`` what you want to install.
ja: このセクションでは、どのようなパッケージが ``aqt`` に用意されているのかを調べ、何をインストールしたいのかを ``aqt`` に指示できるようにするための手順を説明します。

source: This section will help you to reduce the footprint of your Qt installation.
ja: この節では、Qtインストールのフットプリントを減らすための手助けをします。

source: This setting controls how many times ``aqt`` will attempt to download a file, in the case of a checksum error.
ja: この設定は、チェックサムエラーが発生した場合に ``aqt`` がファイルをダウンロードしようとする回数を制御します。

source: This setting has no effect on your ability to install these modules.
ja: この設定はこれらのモジュールをインストールする能力に影響を与えません。

source: This time, ``aqt install-qt`` will only install one archive, ``qtbase``, instead of the ~27 archives it installs by default.
ja: 今回、``aqt install-qt``は、デフォルトでインストールされる約27のアーカイブではなく、``qtbase``という1つのアーカイブだけをインストールします。

source: This will install a total of 6 archives:
ja: これで合計6つのアーカイブがインストールされます:

source: To do this, we can use :ref:`aqt list-qt <list-qt command>` with the ``--arch`` flag:
ja: これを行うには、:ref:`aqt list-qt <list-qt command>` に ``--arch`` フラグを付けて確認します:

source: To find out how to install Qt for WASM, we need to tell :ref:`aqt list-qt <list-qt command>` that we are using the `wasm` architecture.
ja: Qt for WASMをインストールする方法を知るためには、:ref:`aqt list-q t<list-qt command>` に、私たちが ``wasm`` アーキテクチャを使いたい、ということを伝える必要があります。

source: To find out what versions of Qt are available, you can use the :ref:`aqt list-qt command <list-qt command>`.
ja: 利用可能なQtのバージョンを調べるには、 :ref:`aqt list-qt command <list-qt command>` を使うことができます。

source: To install `mingw`, you could use this command (please don't):
ja: `mingw`をインストールするためには、以下のコマンドを使えます(が、使わないでください):

source: To install to ``C:\Qt``, the default directory used by the standard gui installer, you may use this command:
ja: 純正のGUIインストーラが使うデフォルトのディレクトリである ``C:\Qt`` にインストールするには、以下のコマンドを使います:

source: To use ``aqt`` to install Qt, you will need to tell ``aqt`` four things:
ja: Qtをインストールするには、``aqt`` に次の4つのことを伝える必要があります。

source: Turn this option on to install it automatically.
ja: このオプションをオンにすると、自動的にインストールされます。

source: Usage of list command
ja: リストコマンドの使用法

source: Use ``--archive-dest <path>`` to choose where aqt will place these files.
ja: これらのファイルをaqtが配置する場所を選択するには、 ``--archive-dest <path>``を使用します。

source: Use ``aqt list-tool <host> <target>`` to see accepted values.
ja: 利用可能な値を確認するには、 ``aqt list-tool <host> <target>`` を使用してください

source: Use the :ref:`List-Qt Command` to list available architectures.
ja: :ref:`List-Qt Command` を使用して、利用可能なアーキテクチャを一覧表示してください。

source: Use the :ref:`List-Qt Command` to list available versions.
ja: 有効なバージョンを調べるには、:ref:`List-Qt Command` を使用してください。

source: Use the ``--extensions`` flag to list all relevant options for a host/target.
ja: ホスト/ターゲットに関連するすべてのオプションをリストするには、`--extensions``フラグを使用してください。

source: Use the appropriate ``aqt list-*`` command to list available modules:
ja: 適切な ``aqt list-*`` コマンドを使って、利用可能なモジュールをリストしてください:

source: Use the internal extractor, py7zr_
ja: 内部エクストラクタ py7zr_ を使用します。

source: Using the ``--archives qtbase`` flag causes ``aqt install-qt`` to omit roughly 27 archives.
ja: ``--archives qtbase``フラグを使用すると、``aqt install-qt``は約27のアーカイブを省略します。

source: Using this command will install every tool variant available in `tools_mingw`; in this case, you would install 10 different versions of the same tool. For some tools, like `qtcreator` or `ifw`, this is an appropriate thing to do, since each tool variant is a different program. However, for tools like `mingw` and `vcredist`, it would make more sense to use :ref:`aqt list-tool <list-tool command>` to see what tool variants are available, and then install just the tool variant you are interested in, like this:
ja: このコマンドを使用すると、`tools_mingw` で利用可能なすべてのツールバリエーションがインストールされます。この場合、同じツールの10種類の異なるバージョンをインストールすることになります。``qtcreator`` や ``ifw`` のようないくつかのツールでは、それぞれのツールバリエーションが異なるプログラムなので、これは適切なことです。しかし、``mingw``や``vcredist``のようなツールでは、:ref:`aqt list-tool <list-tool command>` を使ってどんなバリエーションが利用可能か調べてから、必要なツールのバリエーションだけをインストールする方が理にかなっています:

source: Version
ja: バージョン

source: Version moved after target
ja: バージョンはターゲットの後に移動しました

source: We can check the architecture and modules available as before:
ja: 以前と同様に、利用可能なアーキテクチャとモジュールを確認できます。

source: We can do that by using the `-m` flag with the :ref:`aqt install-qt <qt installation command>` command.
ja: これは :ref:`aqt install-qt <qt installation command>` コマンドで ``-m`` フラグを使うことでできます。

source: We can do that by using the ``--extension wasm`` flag.
ja: ``--extension wasm`` フラグを使うことで、指定できます。

source: We can do this by using a `SimpleSpec <https://python-semanticversion.readthedocs.io/en/latest/reference.html#semantic_version.SimpleSpec>`_ instead of an explicit version:
ja: これを行うには、明示的なバージョンではなく `SimpleSpec <https://python-semanticversion.readthedocs.io/en/latest/reference.html#semantic_version.SimpleSpec>`_ を使用します。

source: We can install Qt for WASM as before:
ja: 以前と同じようにQt for WASMをインストールできます。

source: We can install these archives using this command:
ja: これらのアーカイブは次のコマンドを使ってインストールできます:

source: We can print a list of these archives with the ``aqt list-qt --archives`` command:
ja: ``aqt list-qt --archives``コマンドでこれらのアーカイブのリストを表示することができます:

source: We can use the ``--long-modules`` flag for that:
ja: そのためには ``--long-modules`` フラグを使うことができます:

source: We know we want to use `armv7` for the architecture, but we don't know exactly what value for 'architecture' we need to pass to :ref:`aqt install-qt <qt installation command>` yet, so we will use :ref:`aqt list-qt <list-qt command>` again:
ja: アーキテクチャに ``armv7`` を使いたいことはわかっていますが、:ref:`aqt install-qt <qt installation command>` に渡す必要のある'アーキテクチャ'の値が正確にはまだ分からないので、もう一度 :ref:`aqt list-qt <list-qt command>` を使います:

source: We saw a list of these when we ran :ref:`aqt list-tool <list-tool command>` with the `tool name` argument filled in.
ja: :ref:`aqt list-tool <list-tool command>` を`tool name` 引数つきで実行したときに、リストに表示されます。

source: When ``--external`` option specified, a value is override with option's one.
ja: ``--external`` オプションが指定されている場合、オプションの指定値で上書きされます。

source: When ``aqtinstall`` is installed **without** recommended library ``py7zr``, it is used to extract archive instead of ``py7zr`` library.
ja: ``aqtinstall`` が **推奨ライブラリ``py7zr``なしで** インストールされている場合、``py7zr`` ライブラリの代わりにアーカイブを抽出するために使用されます。

source: When mirror site cause an error, aqt use fallbacks when possible.
ja: ミラーサイトでエラーが発生した場合は、可能な場合はフォールバックを使用してください。

source: When omitted, the command prints all the targets available for a host OS.
ja: 省略すると、ホストOSで使用可能なすべてのターゲットが出力されます。

source: When set, this prints all 'tool variant names' available.
ja: 設定すると、利用可能なすべての 'ツールバリアント名' を出力します。

source: When set, this prints all architectures available for Qt 5.X.Y with a host/target/extension, or the latest version of Qt if ``latest`` is specified.
ja: 設定すると、ホスト/ターゲット/拡張機能を持つQt 5.X.Yで利用可能なすべてのアーキテクチャを出力します。``latest`` が指定されている場合は、最新バージョンのQtを出力します。

source: When set, this prints all valid arguments for the ``--extension`` flag for Qt 5.X.Y, or the latest version of Qt if ``latest`` is specified.
ja: これを設定すると、Qt 5.X.Yの ``--extension`` フラグの有効な引数をすべて出力します。または、``latest``が指定されている場合はQtの最新バージョンを出力します。

source: When specified version is other than it, command will abort with error when using ``--kde``.
ja: 指定されたバージョンがそれ以外の場合、``--kde`` を指定したコマンドはエラーで中断されます。

source: When using this option, ``aqt`` will print the version that it has installed in the logs so that you can verify it easily.
ja: このオプションを使用すると、``aqt`` はインストールされたバージョンをログに出力するので、簡単に確認できます。

source: When you are happy with the default sites, you can override with your custom settings.
ja: 既定のサイトに問題がなければ、カスタム設定で上書きできます。

source: When you have your own Qt download site repository, you can set it here.
ja: 独自のQtダウンロードサイトリポジトリがある場合は、ここで設定できます。

source: When you install these tools with the standard gui installer, the installer may use the ``installscript.qs`` script to make additional changes to your system.
ja: これらのツールを標準のGUIインストーラでインストールする場合、インストーラは``installscript.qs`` スクリプトを使ってシステムに追加の変更を加えることができます。

source: You are welcome to send a Pull-Request, reporting bugs and ask questions.
ja: Pull-Requestを送信してバグを報告し、質問をすることを歓迎します。

source: You can do this automatically with the ``--autodesktop`` flag:
ja: ``--autodesktop`` フラグをつけることで、自動的にデスクトップバージョンのインストールを実行できます:

source: You can find a list of mirrors at: https://download.qt.io/static/mirrorlist/
ja: ミラーの一覧は次の場所で確認できます: https://download.qt.io/static/mirrorlist/

source: You can install 7-zip on Windows with Choco_.
ja: Windowsでは Choco_ を使って7-zipをインストールすることができます。

source: You can install multiple modules like this:
ja: 次のように、複数のモジュールをインストールできます。

source: You can list available architectures by using ``aqt list-qt`` with the ``--arch`` flag described below.
ja: 利用可能なアーキテクチャを一覧表示するには、以下で説明する ``--arch`` フラグを付けて ``aqt list-qt`` を使用します。

source: You can override this location with the ``--archives-dest`` option.
ja: この場所は、``--archives-dest`` オプションで上書きできます。

source: You can print a list of all acceptable values to use with this command by using the appropriate ``aqt list-*`` command:
ja: 適切な``aqt list-*`` コマンドを使えば、このコマンドで使える全ての値のリストを出力することができます。

source: You can see test results on badge and see details in a web page linked from badge.
ja: テスト結果はバッジで確認でき、詳細はバッジからリンクされたWebページで確認できます。

source: You can specify an alternate 7zip command path instead by using the ``-E`` or ``--external`` flag.
ja: 代わりに、 ``-E`` または ``--external`` フラグを使って7-zipコマンドパスを指定することもできます。

source: You can specify custom configuration file through ``AQT_CONFIG`` environment variable or "-c" or "--config" command line option.
ja: 環境変数 ``AQT_CONFIG`` やコマンドラインオプション``-c``や``--config`` でカスタム設定ファイルを指定することができます。

source: You can specify partial versions, inequalities, etc. ``"*"`` would match all versions of Qt; ``">6.0.2,<6.2.0"`` would match all versions of Qt between 6.0.2 and 6.2.0, etc.
ja: 部分的なバージョンや不等式などを指定できます。``"*"`` はQtのすべてのバージョンにマッチし、``">6.0.2,<6.2.0"`` は6.0.2から6.2.0までのQtのすべてのバージョンにマッチします。

source: You can still misuse the ``--archives`` flag by omitting the ``qtbase`` archive, or by omitting archives that another archive or module is dependent on.
ja: ``qtbase``アーカイブを省略したり、他のアーカイブやモジュールが依存しているアーカイブを省略することで、``--archives``フラグを誤用することもできます。

source: You can use the ``--arch`` flag to see a list of acceptable values for the 'architecture' argument.
ja: 'architecture' 引数に指定できる値のリストを見るには、``--arch`` フラグを使用します。

source: You can use the ``--modules`` flag to see a list of acceptable values.
ja: 受け入れ可能な値のリストを見るために、``--modules`` フラグを使うことができます。

source: You cannot specify this module with ``aqt install-qt --modules``.
ja: このモジュールを``aqt install-qt --modules`` で指定することはできません。

source: You may have noticed that by default, ``aqt install-qt`` installs a lot of archives that you may or may not need, and a typical installation can take up more disk space than necessary.
ja: お気づきかもしれませんが、デフォルトでは ``aqt install-qt`` は多くのアーカイブをインストールしますが、その必要はないかもしれませんし、一般的なインストールでは必要以上のディスク容量を消費します。

source: You may need to modify this list if the default mirrors are unreachable, or if you do not trust that they have not been compromised.
ja: デフォルトのミラーにアクセスできない場合や、ミラーが侵害されていないと信頼できない場合は、このリストを変更する必要があります。

source: You may not notice that there is a problem until you try to compile a program, and compilation fails.
ja: プログラムをコンパイルしようとしてコンパイルが失敗するまで、問題があることに気づかないかもしれません。

source: You should be thinking, "Well, that was silly. All it did was add `android_` to the beginning of the architecture I gave it. Why do I need to use ``aqt list-qt --arch`` for that?" The answer is, ``aqt list-qt --arch`` is checking to see what actually exists in the Qt repository. If it prints an error message, instead of the obvious `android_armv7`, we would know that Qt 6.2.0 for that architecture doesn't exist for some reason, and any attempt to install it with :ref:`aqt install-qt <qt installation command>` will fail.
ja: 「それはばかげている。アーキテクチャの先頭に `android_` を追加しただけだ。 なぜそのために`aqt list-qt--arch`を使う必要があるのか?」おそらく、そう考えるでしょう。 その答えは、``aqt list-qt-arch`` はQtリポジトリに実際に何が存在するかをチェックしているということです。期待した ``android_armv7`` の出力ではなくエラーメッセージが出力された場合、Qt 6.2.0のそのアーキテクチャ用のパッケージが何らかの理由で存在しないことがわかります。そのため、:ref:`aqt install-qt <qt installation command>`でインストールしようとすると失敗します。

source: You should use the :ref:`List-Tool command` to display what tools and tool variant names are available.
ja: :ref:`List-Tool command`を使用して、使用可能なツールとツールバリアント名を表示する必要があります。

source: You will need a Unix-style shell to run this command, or at least git-bash on Windows.
ja: このコマンドを実行するにはUnixスタイルのシェルが必要ですし、Windowsでは少なくともgit-bashが必要です。

source: [Advanced] Specify not to install all base packages.
ja: [高度]すべての基本パッケージをインストールしないように指定します。

source: [Advanced] Specify subset of archives to **limit** installed archives.
ja: [高度] アーカイブのサブセットを指定して、インストールされているアーカイブを**制限**します。

source: ``aqt install-*`` can will still install them without any warnings.
ja: ``aqt install-*`` は警告なしでそれらをインストールします。

source: ``aqt list-qt --archives`` to print which archives are part of the ``debug_info`` module:
ja: ``aqt list-qt --archives``で、どのアーカイブが``debug_info``モジュールの一部であるかを表示します。

source: ``aqt`` is a tool that can be used to install Qt, modules, tools related to Qt, source, docs, and examples, available at https://download.qt.io/.
ja: ``aqt`` は、Qt、モジュール、Qtに関連するツール、ソース、ドキュメント、サンプルなどをインストールするためのツールで、https://download.qt.io/ から入手できます。

source: ``aqt`` transforms the names of modules as they exist in the Qt repository so that they are easier to read and write.
ja: ``aqt`` はQtリポジトリに存在するモジュールの名前を読みやすく書きやすくするために変換します。

source: ``aqtinstall`` can be configured through a configuration file.
ja: ``aqtinstall``は設定ファイルで設定できます。

source: ``aqtinstall`` can safely download archive files from the fallback mirror list, and ensure that they are not malicious files, by checking them against the checksums downloaded from the ``trusted_mirrors`` list.
ja: ``aqtinstall`` は、フォールバックミラーリストからアーカイブファイルを安全にダウンロードし、``trusted_mirrors`` リストからダウンロードしたチェックサムに照らして、それらが悪意のあるファイルでないことを確認することができます。

source: ``aqtinstall`` downloads all checksums from mirrors in this list.
ja: ``aqtinstall`` は、このリスト内のミラーからすべてのチェックサムをダウンロードします。

source: ``aqtinstall`` uses the SHA-256 algorithm to perform this check.
ja: ``aqtinstall`` は、SHA-256アルゴリズムを使ってこのチェックを行います。

source: ``baseurl`` is a URL of Qt download site.
ja: ``baseurl`` はQtダウンロードサイトのURLです。

source: ``concurrency`` is a setting how many download concurrently starts.
ja: ``concurrency`` は、同時に開始するダウンロードの数を設定します。

source: ``connection_timeout`` is a timeout in second for connection.
ja: ``connection_timeout`` は接続の秒単位のタイムアウトです。

source: ``max_retries_on_connection_error`` is an integer that controls how many times ``aqt`` will try to reconnect to the server in the case of a connection error.
ja: ``max_retries_on_connection_error`` は、接続エラーが発生した場合に ``aqt`` がサーバに再接続しようとする回数を制御する整数です。

source: ``print_stacktrace_on_error`` is either ``True`` or ``False``.
ja: ``print_stacktrace_on_error`` は、 ``True`` か``False``を値にとります。

source: ``response_timeout`` is a timeout in second how much time waiting for response.
ja: ``response_timeout``は応答待ち時間の秒単位のタイムアウトです。

source: ``retry_backoff`` is a floating point number that controls how long ``aqt`` will sleep between failed connection attempts.
ja: ``retry_backoff`` は浮動小数点数で、``aqt`` が失敗した接続試行間にスリープする時間を制御します。

source: ``trusted_mirrors`` is a list of URLs that you trust to provide accurate checksums for all downloaded archives. This is a security feature; please do not change this value unless you know what you're doing!
ja: ``trusted_mirrors`` は、ダウンロードされたすべてのアーカイブに対して正確なチェックサムを提供するために信頼しているURLのリストです。これはセキュリティ機能です。何をしているのかわからない限り、この値を変更しないでください!

source: and many other participants and contributors.
ja: 他にも多くの参加者や貢献者がいます。

source: android_armv7, android_arm64_v8a, android_x86, android_x86_64 for android
ja: Androidの場合は： android_armv7, android_arm64_v8a, android_x86, android_x86_64

source: aqtinstall changeLog
ja: aqtinstall変更履歴

source: by adding ``--kde`` option, KDE patch collection is applied for qtbase tree.
ja: 「--kde」オプションを追加すると、qtbaseのソースツリーにKDEパッチコレクションが適用されます。

source: clang_64 for mac desktop
ja: mac デスクトップの場合： clang_64

source: desktop, ios or android
ja: desktop、ios、またはAndroid

source: desktop, ios, winrt, or android.
ja: desktop, ios, winrt, または android

source: desktop, winrt, ios or android.
ja: desktop、winrt、iosまたはandroid。

source: display version
ja: バージョンの表示

source: each pull request can consist of multiple commits.
ja: 各プルリクエストは複数のコミットで構成されます。

source: every proposal for modification should send as 'Pull Request'
ja: 修正案はすべて「プルリクエスト」として送信する必要があります。

source: gcc_64 for linux desktop
ja: Linuxデスクトップの場合： gcc_64

source: install tools specified.
ja: 指定されたツールをインストールします。

source: install-doc command
ja: install-docコマンド

source: install-example command
ja: install-exampleコマンド

source: install-qt command
ja: install-qtコマンド

source: install-src command
ja: install-srcコマンド

source: install-tool command
ja: install-toolコマンド

source: linux, windows or mac
ja: linux、windows、またはmac

source: linux, windows or mac.
ja: linux, windows または、mac.

source: list-doc command
ja: list-docコマンド

source: list-example command
ja: list-exampleコマンド

source: list-qt command
ja: list-qtコマンド

source: list-src command
ja: list-srcコマンド

source: list-tool command
ja: list-toolコマンド

source: not supported
ja: サポートされない

source: show generic help
ja: 汎用ヘルプの表示

source: the 1 archive ``qtcharts`` from the ``qtcharts`` module, and
ja: ``qtcharts``モジュールからのアーカイブ``qtcharts``、および

source: the 2 archives ``qtbase`` and ``qtdeclarative`` from the base Qt installation.
ja: 基本Qtインストールの``qtbase``と``qtdeclarative``の2つのアーカイブです。

source: the 3 archives named ``qtbase``, ``qtcharts``, and ``qtdeclarative`` from the ``debug_info`` module,
ja: ``debug_info``モジュールからの3つのアーカイブ ``qtbase``、``qtcharts``、``qtdeclarative``

source: tool name may be 'tools_openssl_x64', 'tools_vcredist', 'tools_ninja', 'tools_ifw', 'tools_cmake'
ja: ツール名は'tools_openssl_x64'、'tools_vcredist'、'tools_ninja'、'tools_ifw'、'tools_cmake'のいずれかです。

source: tool variant names may be 'qt.tools.win64_mingw810', 'qt.tools.vcredist_msvc2013_x64'.
ja: ツールバリアント名は'qt.tools.win64_mingw810','qt.tools.vcredist_msvc2013_x64'のようになります。

source: win64_msvc2019_64, win64_msvc2017_64, win64_msvc2015_64, win32_msvc2015, win32_mingw53 for windows desktop
ja: Windowsデスクトップの場合は、win64_msvc2019_64, win64_msvc2017_64, win64_msvc2015_64, win32_msvc2015, win32_mingw53

source: you are encourage to split modifications to individual commits that are logical subpart.
ja: 変更を論理的なサブパートである個々のコミットに分割することをお勧めします。
